/**
 * date : 2018-01-08 03:55:01
 * description : 页面展示字段专用字典
 *
 * @author ₆⁶₆⁶₆⁶
 */

/**
 * 获取指定的字典
 * @param DictName - 字典名称
 * @return {*}
 */
function getDict(DictName) {
    return Dict[DictName];
}

var Dict = {

    // 订单状态
    "order": {
        "status": {
            '1': '未支付', '2': '订单取消', '3': '已付款', '4': '退款申请中',
            '5': '已退款', '6': '退款失败', '7': '已退款(扣除部分费用)',
            '8': '使用中', '9': '已完成', '10': '已过期', '11': '超时未支付', '13': '已使用(自动核销)', '14': '已过期(自动核销)',
            '20': '废单'
        }
    },
    "orderDetail": {
        "status": {
            '0': '未使用', '1': '已使用', '2': '计时中', '3': '已退押金','4': '退款申请中','5': '已退款'
        }
    },
    "calculate": {
        "calculateType": {
            '0': '普通计费', '1': '按时计费'
        }
    },
    "cardType": {
        "useCardType": {
            '1': '身份证', '2': '护照', '3': '港澳台通行证'
        }
    },
    "orderDiscountDetail": {
        "status": {
            '0': '已发放', '1': '已取消'
        }
    },
    "orderScenicDetail": {
        "status": {
            '0': '未使用', '1': '已激活', '2': '已使用', '4': '退款中',
            '5': '已退款', '10': '已过期', '11': '订单超时未支付'
        }
    }
};